<template>
  <div class="app-container">
    <div class="app-container-inner">
      <h2>数据摆渡系统使用说明</h2>
      <div>
        <h3>系统说明</h3>
        <el-text
          >&ensp;&ensp;&ensp;&ensp;数据摆渡是指内网环境与外网需要安全隔离的情况下，通过建立数据传输隧道以解决两个网络间数据传输的问题，实际的数据传输隧道也会根据保密需求有所差异。本系统的使用人群仅包括实验室内部的学生与管理员。学生是系统的主要使用群体，也是数据摆渡请求的发起者。而后者则是实验室的管理人员，负责对摆渡过程中的数据进行审批，尽可能避免保密数据泄露问题的发生，并且当数据发生泄露时，也能够即时追查。</el-text
        >
        <br />
        <br />
        <el-text
          >&ensp;&ensp;&ensp;&ensp;本系统包含两个方向的数据摆渡问题，即从外网到内网和从内网到外网。前者不需要过多文件保密性需求，主要提供一个临时的文件存储区供上传文件。对于后者，本系统则建立了一套规范的且编写的文件摆渡审批过程，通过规范化数据拷贝流程，以减少数据摆渡对内网环境的影响和破坏。系统通过建立一套完善的审批制度，在保证涉密数据不被泄露的前提下，尽可能满足学生的数据拷贝需求，提高管理员的工作效率。同时，系统也会存储每次摆渡的记录，保证每条数据的可追溯性。</el-text
        >
      </div>
      <br />
      <div>
        <h3>系统介绍</h3>
        <el-text>本系统分为三个端：学生端、拷贝机端、管理员端</el-text>
        <br />
        <el-text
          >学生端为实验室学生在实验室的个人电脑(Linux系统)使用，主要功能包括：通过创建提交工单来向外摆渡文件、下载从拷贝机上传到系统的文件、查看修改个人信息等。具体功能可通过登录学生端查看。</el-text
        >
        <br />
        <br />
        <el-text
          >拷贝机端是实验室的一台公用电脑(Windows系统)，主要功能包括：学生用U盘拷贝自己通过工单提交的文件、学生上传需要在实验室个人电脑下载的文件。具体功能可通过登录拷贝机端查看。</el-text
        >
        <br />
        <br />
        <el-text
          >管理员端是管理员的个人PC，主要功能包括：创建管理学生，管理员账号、审核学生提交的工单、切换审批模式、查看学生上传的文件、查看日志等。具体功能可通过登录管理员端查看。</el-text
        >
      </div>
      <br />
      <div>
        <h3>整体流程说明</h3>
        <el-text>
          (1)&ensp;&ensp;向外摆渡整体流程：学生登录学生端后，通过新建工单，填写工单信息并上传对应文件后提交工单。&ensp;&ensp;管理员登录管理员下载查看学生上传的文件后，决定审批是否通过，并给出审批意见。&ensp;&ensp;如果审批通过学生即可在拷贝机上通过工单号下载需要摆渡的文件。
        </el-text>
        <br />
        <br />
        <el-text>
          (2)&ensp;&ensp;上传文件整体流程：学生通过拷贝机端上传自己需要的文件，然后在实验室自己的电脑上登录学生端直接下载即可。
        </el-text>
      </div>
      <div>
        <h3>注意事项</h3>
        <el-text>
          (1)&ensp;&ensp;管理员端有三种工单审批模式：即时审批、定期审批、超前审批。<br />&ensp;&ensp;即时审批模式下，学生需等到管理员审核完文件后才可在拷贝机端下载文件。&ensp;&ensp;定期审批模式下，学生提交工单后即可在拷贝机端下载文件。<br />&ensp;&ensp;超前审批：超前审批是即时审批下的特殊情况，是为了应对管理员无法及时审批工单与学生迫切需要摆渡文件的矛盾。在这种情况下，学生可联系管理员(微信/邮箱等)获取超前审批密钥，在工单管理处点击超前审批，通过后即可在拷贝机端下载文件。
        </el-text>
        <br />
        <br />
        <el-text>
          (2)&ensp;&ensp;学生需要向外摆渡的文件&ensp;系统&ensp;会通过压缩包加密的形式保存和下载，解压密码在拷贝机端告知。对工单的所有操作均会记录日志供管理员查看，以保证可工单的可追溯性。
        </el-text>
        <br />
        <br />
        <el-text>
          (3)&ensp;&ensp;所有文件都会保存在服务器上，由于服务器磁盘大小有限，系统会记录每个学生上传的文件。管理员会通过查看学生上传的文件所占磁盘大小决定是否删除该文件，文件被删除后学生便无法在实验室个人电脑处下载。对文件的所有操作均会记录日志供管理员查看，以保证可工单的可追溯性。
        </el-text>
        <br />
        <br />
        <el-text>
          (4)&ensp;&ensp;为减轻管理员审批压力，工单的创建需要满足一定的条件：<br />1.
          如果当前存在正在流程中（创建中、审批中）的工单，则不能创建工单<br />2.
          如果当前自然周内可拷贝、审批成功和审批失败的工单总数超出最大限制，则不能创建工单<br />3.
          如果当前属于定期审批，上个自然周剩余的（可拷贝的）工单数超出最大限制，则不能创建工单
        </el-text>
        <br />
        <br />
        <el-text>
          (5)&ensp;&ensp;由于Linux系统无法直接使用中文，所以学生上传的文件(从外部上传或从内部上传)请使用英文命名。&ensp;由于系统对工单数量做出来一定限制，如有大量文件摆渡需求，可以将多个文件压缩成一个压缩包然后上传。
        </el-text>
      </div>
    </div>
  </div>
</template>
<script setup lang="ts"></script>

<style scoped lang="scss">
  @import './index';
</style>
